module.exports.config = {
  name: "gcname",
  version: "1.0.0",
  hasPermission: 0,
  credits: "𝐒𝐡𝐚𝐡𝐚𝐝𝐚𝐭 𝐈𝐬𝐥𝐚𝐦",
  description: "Random fun reply when someone says gcname",
  commandCategory: "Fun",
  usages: "[gcname]",
  cooldowns: 2,
};

const botReplies = [

"⑅⃝❥»̶̶͓͓͓̽̽̽»̶̶͓͓̽̽̽🥰𝔸𝔻𝔻𝔸~ʌ̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋~𝔾ℝ𝕆𝕌ℙ😍»̶̶͓͓͓̽̽̽⑅⃝✺💘💖",
"᯽ꕥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿প্রেম ইজꕥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿প্যারা༆̲̲̲̞̎̎̎̎͢বন্ধুত্ব༆̲̲̲̞̎̎̎̎͢সেরাꕥ̳̳̳̳̳̳̳̳̳̳̿̿̿᯽",
"═❥𝄞⋆⃝ 亗রং ঢং মাস্তি亗🩷  ●══❥𝄞⋆⃝",
"ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿ মায়ার বাধঁনꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿𝒜◥⃧⃜ؖؖؖؖ⃝ࣩࣩࣩࣩࣩࣩࣩࣩࣩࣩࣩ❥•❃ ",
"𝄞⋆⃝ʀᴇᴄʀᴏʀ°ɢʀᴏᴜᴘ°ᴀʟʟ◥⃧⃜ؖؖؖؖ⃝ࣩࣩࣩࣩࣩࣩࣩࣩࣩࣩࣩ ᴛɪᴍᴇ°ʙᴋ√ᴛᴏ√ʙᴋ⋆⃝𝄞🌸◥⃧⃜ؖؖؖؖ⃝ࣩࣩࣩࣩࣩࣩࣩ",
"⑅⃝ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿আসুন সবাই ꓹ⃟ꓹ⃟  পরিচিত༆̲̲̲̞̎̎̎͢🅞l⃟ S⃟ হইꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿ꓹ⃟",
"⑅⃝❥»̶̶͓͓͓̽̽̽»̶̶͓͓̽̽̽🥰কলিজাদের~ʌ̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋~আড্ডা😍»̶̶͓͓͓̽̽̽⑅⃝✺💋",
"⋆⃝𝗧𝗢𝗣⃪⃝ 🤟➊༒🅿🅿༒🅱🅾🆇""⋆⃝📸🩷➔𝄞⋆⚔➔𝄞⋆⃝",
"
"༓͚͚͚͚͚͚͚̿̊̿̊̿̊̿░⃟̎̎̎̎̐Ö̫́̈́N̫̈́̈́L̫̈́̈́Y༒𝄞⋆⃝ NICK★NaMe𝄞⋆𝙰 ░⃟̎̎̎̎̐B̫̈́̈́Ö̫́̈́Ẍ̫́̈́❥͜͜͡͡༓͚͚͚͚͚͚͚̿̊̿̊̿̊̿░⃟̎̎̎",
"🌷3️⃣O͜͡n͜͡l͜͡y͡ N͜͡i͜͡c͜͡k͜͡N͜͡a͜͡m͜͡e͜͡💯 T͜͡e͜͡x͜͡t͜͡ n͜͡o͜͡t͜͡ a͜͡l͜͡l͜͡o͜͡w͜͡",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿̿ꓸ⃟ꓸ⃟ꓸ⃟ꓸ♥ ⃝বন্ধুদের🌼⃝চায়ের💚⃝আড্ডা🌺⃝🅱︎🄾🆇︎𝄞⃪⃝⋆𓊉𒍮",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿̿ꓸ⃟ꓸ⃟ꓸ⃟ꓸ♥ ⃝দুষ্টু মিষ্টি🌼⃝বন্ধুরা🌺⃝🅱︎🄾🆇︎𝄞⃪⃝⋆𓊉𒍮ꗥ̳̳̳̳̳̳̳̳̳̳̿̿",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿̿ꓸ⃟ꓸ⃟ꓸ⃟ꓸ♥ ⃝কোরআনের🌼⃝পথচলা💚⃝🌺⃝🅱︎🄾🆇︎𝄞⃪⃝⋆𓊉𒍮ꗥ̳̳̳̳̳̳̳̳̳̳̿̿",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿̿ꓸ⃟ꓸ⃟ꓸ⃟ 👼⍣⃝বিঁষাঁক্তঁ🩷⃝🩵⃪⃝🌼⃪⃝fমাঁয়াঁ🩷⃪⃝♡🪄🪽",
"‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎⟣⃟⸻༎আঁড্ডাঁখাঁনাঁ‎‎‎‎‎‎‎‎‎‎‎‎‎",
"─༅༎•🌺🌸༅༎•মজার আস্তানা─༅༎•🌸༅༎•",
"⃠𖤐ইসলামিক ক্যাপশন বক্স༻",
"✾𝄞⋆⃝𓊈‎✾𝐓𝐎𝐏ܔ𝐏𝐍𝐆𝄞𝐋𝐎𝐆𝐎⑅⃝➔𝄞🅑︎🅞︎🅧︎✾𝄞 ⋆⃝𓊈‎✾",
"⑅⃝ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿হাসির ꓹ⃟ꓹ⃟ বাজার༆̲̲̲̞̎̎̎͢ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿ꓹ⃟",
"꧁(•̀ᴗ•́)وꕥ̳̳̳̳̳̳̳̿̿̿̿̿ꔷ⃟ꔷ⃟꧁➤⃟♥⃪⃝ 🆃︎🅸︎🅺︎ °᭄࿐TOK ⑅⃝»̶̶͓͓͓̽̽̽»̶̶͓͓͓̽̽̽๓๏BOX ꕥ☬♥⃪⃝☬(•̀",
"ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿̿ꔹ̐̑̐̑̐̑̐̑ꔹ⃟ꔹ𝐏𝐫𝐨𝐟𝐢𝐥𝐞 PP Collection Boxꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿̿ꔹ⃟ 𝐁ꔹ⃟ꔹ̐̑̐",
"༓͚͚͚͚͚͚͚̿̊̿̊̿̊̿̊◎⃝༆༄✍️ only stylish bio-✍️No❌ Text⚠.༓͚͚͚͚͚͚͚̿̊̿̊̿̊̿̊◎⃝💋"
"»̶̶͓͓͓̽̽̽⑅⃝❥᭄𝑷𝑵𝑮`”𝑭𝒓𝒆𝒂𝒎❥ »̶̶͓͓͓̽̽̽𝑩𝒐𝒙`❥ »̶̶͓͓͓̽̽̽”𝑻𝒆𝒙𝒕”𝑶𝒇𝒇❥»̶̶͓͓͓̽̽̽⑅⃝❥᭄",
"𖣘✪»̶̶͓͓͓̽̽̽⑅⃝✺❥᭄ কি্ঁছু্ঁ £ স্ঁপ্ন্ঁ £ কি্ঁছু্ঁ £ আ্ঁশা্ঁ 𖣘✪»̶̶͓͓͓̽̽̽⑅⃝✺❥᭄",
"💘꧁লা্ঁভ্ঁ💗✵💗এ্ঁক্স্ঁপ্রে্ঁস্ঁ꧂💘",
"╰┈⫸𝑩ི𝒆ི𝒔ི𝒕ི ི𝑭ི𝒓ི𝒊ི𝒆ི𝒏ི𝒅ི𝒔ི ི𝑨ི𝒅ི𝒅ི𝒂ི⫷┈┈╯",
"꧁ঔৣ☬✞A͙d͙d͙a͙ B͙o͙x͙ ✞☬ঔৣ꧂",
"➤❀๑▬▬๑♥۩۩ ♥๑▬▬๑❀➤🌺💜",
"⫷⑅⃝✺»̶̶͓͓͓̽̽̽🄻🄾🅅🄴»̶̶͓͓͓̽̽̽🅂🅃🄾🅁🅈»̶̶͓͓͓̽̽̽⑅⃝✺❥᭄",
"ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿̿❂⃝⃘ཻ࿆💞 Love 💞 ❂⃝⃘ཻ࿆ Storeꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿̿̿̿",
"Pagol Vs Pagli꧁꧂☘︎☘︎♪༒︎༒︎༒︎",
"┈•❀✾•°⫷💓স্বপ্নের জীবন💓⫸°❀•┈",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿ꔷ⃟ꔷ⃟꧁➤⃟♥⃪⃝ প্র‍্যা্ঁম্ঁ°᭄࿐",
"⑅⃝»̶̶͓͓͓̽̽̽»̶̶͓͓͓̽̽̽๓๏ђবা্ঁজা্ঁꕥর্ঁค☬♥⃪⃝☬꧂",
"ꔹ⃟♥⃝»̶̶͓͓͓̽̽̽ꔹ⃟ꔹ⃟ তাজমহলꔹ⃟ꔹ⃟♥⃝»̶̶͓͓͓̽̽̽ꔹ⃟",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿̿ꔷ⃟➤⃟♥⃪পি্চ্ছি্ঁ রি্ফা্ঁত্ঁ এ্ঁর্ঁꗥ⃟ꗥ̳̳̳̳̳̳̳̳̳̳̿̿̿-রাঁজ্যঁ♥⃪⃝☬ꕥ̳̳̳̳̳̳̳̿̿̿̿̿",
"ꕥ̳̳̳̳̳̳̳̿̿̿̿✮ꕥ̳̳̳̳̳̳̳̿̿̿̿ Friends🌺Masti৺❥᭄ꕥ̳̳̳̳̳̳̳̿̿̿̿✮ꕥ̳̳̳̳̳̳̳̿✮ꕥ̳̳̳̳̳̳̳̿̿̿̿",
"ꖴؖؖؖؖؖؖؖؖؖꔰ⃟❤️ꕬ⃢👺ꖴؖؖؖؖؖؖؖؖؖশঁয়ঁতাঁনেঁরঁꔰ⃟ꖴؖؖؖؖؖؖؖؖؖআঁড্ডাঁꔰ⃟ꔹꕬ⃢👹ꖴؖؖؖؖؖؖؖؖ",
"ꖴ⃕⃔⃝⃯⃮ꖴؓؓؓؓؓؓؓؓؓؓꔹꔰ⃟ꕬ⃢☕❤️কঁফিঁ⃣๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊হাঁউঁসেঁরঁ আঁড্ডাঁؖؖؖؖؖؖؖؖꔰ⃟ꕬ⃢🍹ꖴؖؖؖؖؖؖؖؖؖؖؖ",
"♥⃝»̶̶͓͓͓̽̽̽ꔹ⃟ꔹ⃟ꕀ⃘⃜⃟ؖؖؖؖؖؖؖؖؖꙮ͌͌͌͌͌͌͌͌͌͌͌͌͌͌ ⑅⃝»̶̶͓͓͓̽̽̽»̶̶͓͓͓̽̽̽๓ All Friends ন্ꕀ⃘⃜⃟ؖؖؖؖؖؖؖؖꙮ͌͌͌͌͌͌͌͌͌͌͌͌͌͌ꔹ⃟ꔹ⃟♥⃝»̶̶͓͓͓̽̽̽",
"♥⃝»̶̶͓͓͓̽̽̽ꔹ⃟ꔹ⃟ꕀ⃘⃜⃟ؖؖؖؖؖؖؖؖؖꙮ͌͌͌͌͌͌͌͌͌͌͌͌͌͌ ⑅⃝»̶̶͓͓͓̽̽̽»̶̶͓͓͓̽̽̽๓Loverꕀ⃘⃜⃟ؖؖؖؖؖؖؖؖؖꙮ͌͌͌͌͌͌͌͌͌͌͌͌͌͌ꔹ⃟ꔹ⃟♥⃝»̶̶͓͓͓̽̽̽",
"⑅⃝❥»̶̶͓͓͓̽̽̽»̶̶͓͓̽̽̽🥰ক্যা্ঁপ্ঁশ্ঁন্ঁ~ʌ̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋̋~ব্ঁক্স্ঁ😍»̶̶͓͓͓̽̽̽⑅⃝✺💋",
"⏤͟͟͞❥͜͡𝄟🌼🦋রিঁয়েঁক্টঁরঁ🌿ক‍্যাঁপঁশঁনঁ🌿",
"🍂•┼┼•◈Friends Club◈•┼┼•🍂",
"꧁🌿🌺 Guys🌿🌺꧂",
"➤❀๑▬▬๑♥۩۩ ♥๑▬▬๑❀➤🌺💜💢All time ➖Masti💢💜🌺",
"___🍀 🇳🔴🇮🌿🇨🔴🇪🍀___",
"💣🔴💜▄▄ All time Adda ▄▄💜🔴💣",
"🔵★─┼🔴 Friends Masti 🔴─┼★─🔵",
"♥ ❥❥══❥Study Group",
"💘꧁Love💗✵💗ExPress꧂",
" 😍🌼Lovely⚘🌼💖🌼Lovely ⚘🌼💖",
"❥══❥Friends Forever_▓♥",
"⫷━•༻❃বন্ধুদের আড্ডা❃༺•━⫸",
"⫷━•༻❃রং ঢং মাস্তি❃༺•━⫸"

];

module.exports.run = async function ({ api, event }) {
  const reply = botReplies[Math.floor(Math.random() * botReplies.length)];
  api.sendMessage(reply, event.threadID, event.messageID);
};
