module.exports.config = {
 name: "rulesv2",
 version: "1.0.0",
 hasPermssion: 0,
 credits: "BELAL BOTX666",
 description: "Send group rules",
 commandCategory: "information",
 usages: "rulesv2",
 cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
 const message = `✡️
 ✧⫷━༻রূ্ঁপ্ঁক্ঁথা্ঁর্ঁ আ্ঁড্ডা্ঁ ঘ্ঁর্ঁ❃༺━⫸✧ গ্রুপের পক্ষ থেকে 
⚠️⛔..Admin Notice ⛔ ⚠️

আসসালামু আলাইকুম ! 

  ⛔Group Rules ⛔
ডিয়ার মেম্বার, আশাকরি আপনারা সবাই ভালো আছেন? 🫶
আমাদের  সবার প্রিয় গ্রুপ এটা একটি  ফ্যামিলির মতো। এখানে আমরা সবাই মিলেমিশে একসাথে থাকি। গ্রুপের কিছু Rules রয়েছে।সেই Rules গুলো নিচে দেয়া হলো আশাকরি সবাই মনোযোগ সহকারে পড়ে নিবেন ।👇

১⛔গ্রুপে ঠিকমতোActive থাকতে হবে। সবাইকে মিলে মিশে থাকতে হবে এবং সবাই সবার সাথে ভালো আচরন করতে হবে। 👍🤝

২⛔গ্রুপ কে ভালোবেসে সবসময় গ্রুপের পাশে থাকতে হবে ।এবং গ্রুপটাকে নিজের গ্রুপ মনে করে থাকতে হবে!!🫵👍

৩⛔এখানে যেহেতু মেয়ে /ছেলে থাকি সুতরাং সবাই সবাইকে সম্মান করতে হবে এবং কাউকে হেয়ও করে কথা বলা যাবেনা!!☺️

৪⛔কোন ছেলে কোন মেয়ের ইনবক্সে যেতে পারবেনা এবং কোন মেয়ে কোন ছেলের ইনবক্সে যেতে পারবেনা!! যদি এমন কিছু প্রমান পাওয়া যায় তাকে গ্রুপ থেকে বের করে দেয়া হবে।🫴🙃

৫⛔ গ্রুপে অসভ্যতার পরিচয় দেয়া যাবেনা এবং কোন ধরনের কোন  বাজে কথা  বা গালাগালি করা যাবেনা! এবং কাউকে insult করে কথা বলা যাবে না। 🚫

৬⛔ ম্যাসেঞ্জার গ্রুপে নিউ মেম্বার এড হলে সাথে সাথে নাম Mentioneকরে Welcome করতে হবে এবং নিউ মেম্বারদের সাথে ভালো ভাবে পরিচিত হতে হবে।🤗🫡

৭⛔ গ্রুপ এডমিন কে সম্মান করতে হবে সব সময়।। টেক্সট অফ দিলে কোনো টেক্সট করা যাবে না।🚫🫴

৮🚫উপরে উল্লেখিত রুলস অমান্য কারিকে গ্রুপে রাখা হবেনা।রিমুভ করা হবে ,,। 🥀🥀
    কোন প্রকার সমস্যা হলে এডমিন 
1. AS Alif Hossain
2. নিঝুম দ্বীপের রাজ কন্যা
3. চাঁদের পাহাড়
4. Sadia Sultana Riya
5. অচিন পুরের রাজকুমারি
6. মেৃঁঘৃঁ বাৃঁলাৃঁ
7. AS Alif Hossain
 👍সাথে যোগাযোগ করুন 🤝
 🥰 ধন্যবাদ  এডমিন প্যানেল@everyone🟢`;

 return api.sendMessage(message, event.threadID);
};
